{"Today's date": "2023-05-02", "Today's featured article": "Constantine III (died 411) was a common Roman soldier who was declared emperor in Roman Britain in 407. He moved to Gaul (modern France), taking all of the mobile troops and their commander Gerontius from Britain to confront bands of Germanic invaders. Constantine stabilised the situation and established control over Gaul and Hispania (modern Spain and Portugal). Honorius, the Western Roman emperor, sent an army to expel Constantine's forces. After initial victories it was repulsed. In early 409 Honorius recognised Constantine as co-emperor. Constantine in turn raised his oldest son to co-emperor as Constans II. In 409 Gerontius rebelled, defeating and killing Constans in early 411. Meanwhile, Honorius appointed a new general, Constantius, who besieged Constantine in Arles. A relief force was ambushed and he abdicated, took holy orders and – promised his life – surrendered. Constantius had lied: Constantine was killed and his head presented to Honorius on a pole in September 411. ", "Did you know": ["... that female pygmy swordtails prefer male Panuco swordtails, which court them, to males of their own species (pictured), which merely sneak up on them?", "... that Patrick O'Brian's Testimonies received reviews that variously described it from \"clumsy in construction to the point of amateurishness\" to \"rare and beautiful\"?", "... that during World War II, Oscar Holmes became the first black US naval aviator only because the still-segregated Navy initially thought that the light-skinned Holmes was white?", "... that Green Day wrote a tribute song for singer Amy Winehouse following her death, despite never having met her?", "... that N. Porsenna, who translated The Ballad of Reading Gaol into Romanian, spent seven years in communist prisons?", "... that the contrabass trombone has experienced a revival in film music and video game soundtracks?", "... that after he retired from professional baseball, Paul Hinrichs became a Lutheran minister?", "... that the African Union has set up a space agency in a Space City?"], "In the news": ["Luca Brecel (pictured) wins the World Snooker Championship.", "Ding Liren defeats Ian Nepomniachtchi to win the World Chess Championship.", "In Kenya, at least 110 people have died and more than 350 others are missing after the leader of the Malindi cult allegedly instructed members to starve themselves.", "In the London Marathon, Sifan Hassan wins the women's race and Kelvin Kiptum wins the men's event.", "The wreckage of the Montevideo Maru is discovered in the South China Sea."], "On this day": ["1194 – King Richard I of England gave the city of Portsmouth (Old Portsmouth pictured) its first Royal Charter.", "1559 – Presbyterian clergyman John Knox returned from exile to lead the Scottish Reformation.", "1670 – A royal charter granted the Hudson's Bay Company a monopoly in the fur trade in Rupert's Land (present-day Canada).", "1999 – Mireya Moscoso became the first woman to be elected President of Panama.", "2003 – Cyclone Manou formed in the Indian Ocean; over the next two weeks it struck Madagascar and left more than 100,000 people homeless.", "2011 – Osama bin Laden was shot and killed by U.S. Navy SEAL Team 6 in a private residential compound in Abbottabad, Pakistan."]}
